---
type: IExternalEventHandler
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# IExternalEventHandler

`Autodesk.Revit.UI.IExternalEventHandler` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Execute | 2013 | `void Execute ( UIApplication app )` |
| Method | GetName | 2013 | `string GetName ()` |